tutorials/rhoSonicFoam/forwardStep/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-15;
        relTol           0;
    };
    rho PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-15;
        relTol           0;
    };
    rhoU PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-15;
        relTol           0;
    };
    rhoE PBiCG
    {
        preconditioner   DILU;
        tolerance        1e-15;
        relTol           0;
    };
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
}


// ************************************************************************* //
